5. laminar flow backward-facing step/Re300/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingHLLCFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4800;

deltaT          1e-2;//2e-05;

writeControl    adjustableRunTime;

writeInterval   25;

cycleWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

maxDeltaT       1;

CourantType     cellCourant;

// ************************************************************************* //
